package com.livehereandnow.ages.card;

import java.util.ArrayList;
import java.util.HashSet;
import java.util.List;
import java.util.Set;
//import javax.persistence.EntityManager;
//import javax.persistence.EntityManagerFactory;
//import javax.persistence.Persistence;

public class AgesCardFactory {

    private static final String PERSISTENCE_UNIT_NAME = "agesPU";
//    private static EntityManagerFactory factory;
//    private static EntityManager em;

    public AgesCardFactory() {
//        factory = Persistence.createEntityManagerFactory(PERSISTENCE_UNIT_NAME);
//        em = factory.createEntityManager();
    }

    private void removeCardById(List<AgesCard> list, int id) {
        for (AgesCard card : list) {
            if (card.getId() == id) {
                list.remove(card);
                return;
            }
        }
    }

    public List<AgesCard> getAgeCivil(int age) {
        List<AgesCard> list = getEntireList();
        List<AgesCard> newList = new ArrayList<>();
        AgesCard card;
        for (int k = 0; k < list.size(); k++) {
            card = list.get(k);
            if (card.getAge() == age && card.getCivilMilitary().equals("內政")) {
                newList.add(card);

            }
        }

        if (age == 0) {
            removeCardById(newList, 1001);
            removeCardById(newList, 1010);
            removeCardById(newList, 1011);
            removeCardById(newList, 1007);
            removeCardById(newList, 1032);
            removeCardById(newList, 1018);
        }
//        for (AgesCard card : list) {
//            if (card.getCivilMilitary().endsWith("內政")) {
//                if (card.getAge() == age) {
//                    newList.add(card);
//                    list.remove(card);
//                }
//            }
//        }
        return newList;
    }

    public AgesCard getNOCARD() {
        AgesCard temp = new AgesCard();
        temp.setId(1000);

        temp.setName("");
        temp.setAge(4);
        temp.setTag("");
        return temp;

    }

    public AgesCard getCardByName(String name) {
        List<AgesCard> list = getEntireList();
        AgesCard card;
        for (AgesCard list1 : list) {
            card = list1;
            if (card.getName().equals(name)) {
                return card;
            }
        }
        return getNOCARD();
    }

    public List<AgesCard> getAgeMilitary(int age) {
        List<AgesCard> list = getEntireList();
        List<AgesCard> newList = new ArrayList<>();
        AgesCard card;
        for (int k = 0; k < list.size(); k++) {
            card = list.get(k);
            if (card.getAge() == age && card.getCivilMilitary().equals("軍事")) {
                newList.add(card);

            }
        }

//        for (AgesCard card : list) {
//            if (card.getCivilMilitary().endsWith("內政")) {
//                if (card.getAge() == age) {
//                    newList.add(card);
//                    list.remove(card);
//                }
//            }
//        }
        return newList;
    }

    public List<AgesCard> getEntireList() {
        List<AgesCard> ca = new ArrayList<>();
        //
        ca.add(new AgesCard(5219, 1124, "防禦卡", 2, "軍事", "獎勵", "防禦+4 殖民+2", "", "", "null", "雙色", 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5220, 1058, "防禦卡", 1, "軍事", "獎勵", "防禦+2 殖民+1", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5221, 1124, "防禦卡", 2, "軍事", "獎勵", "防禦+4 殖民+2", "", "", "null", "雙色", 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5222, 1208, "防禦卡", 3, "軍事", "獎勵", "防禦+6 殖民+3", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5223, 1058, "防禦卡", 1, "軍事", "獎勵", "防禦+2 殖民+1", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5224, 1124, "防禦卡", 2, "軍事", "獎勵", "防禦+4 殖民+2", "", "", "null", "雙色", 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5225, 1208, "防禦卡", 3, "軍事", "獎勵", "防禦+6 殖民+3", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5226, 1058, "防禦卡", 1, "軍事", "獎勵", "防禦+2 殖民+1", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5227, 1124, "防禦卡", 2, "軍事", "獎勵", "防禦+4 殖民+2", "", "", "null", "雙色", 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5228, 1208, "防禦卡", 3, "軍事", "獎勵", "防禦+6 殖民+3", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5229, 1037, "中世紀軍隊", 1, "軍事", "戰術", "xxx", "步:1;馬:1", "武器:2", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5230, 1040, "兵陣", 1, "軍事", "戰術", "", "步:2", "", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5231, 1042, "軍團", 1, "軍事", "戰術", "", "步:3", "武器:2", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5232, 1058, "防禦卡", 1, "軍事", "獎勵", "防禦+2 殖民+1", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5233, 1124, "防禦卡", 2, "軍事", "獎勵", "防禦+4 殖民+2", "", "", "null", "雙色", 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5234, 1208, "防禦卡", 3, "軍事", "獎勵", "防禦+6 殖民+3", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5235, 1225, "武裝入侵", 3, "軍事", "侵略", "侵略成功時,受害方:失去七點文明點數,侵略方:獲得七點文明點數", "消耗紅點:2", "", "null", "深棕色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5236, 1013, "富饒之土", 0, "內政", "行動", "少花費一個資源建造一個農場或礦場", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5237, 1017, "建築工地", 0, "內政", "行動", "建築一座新的城市建築少花費一個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5238, 1028, "節儉", 0, "內政", "行動", "以正常價格增加一個人口後,獲得一個食物", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5239, 1037, "中世紀軍隊", 1, "軍事", "戰術", "", "步:1;馬:1", "武器:2", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5240, 1040, "兵陣", 1, "軍事", "戰術", "", "步:2", "", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5241, 1042, "軍團", 1, "軍事", "戰術", "", "步:3", "武器:2", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5242, 1044, "劍士", 1, "內政", "步兵", "", "燈泡:3;石頭:3", "武器:2", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 0, 0));
        ca.add(new AgesCard(5243, 1048, "印刷術", 1, "內政", "圖書館", "", "燈泡:3;石頭:4", "音樂:1;燈泡:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(5244, 1053, "河蟹娛樂", 1, "內政", "競技場", "", "燈泡:3;石頭:4", "武器:1;笑臉:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(5245, 1058, "防禦卡", 1, "軍事", "獎勵", "防禦+2 殖民+1", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5246, 1059, "奴役", 1, "軍事", "侵略", "侵略成功時,受害方:失去一個人口,侵略方:獲得三個資源", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5247, 1061, "富饒之土", 1, "內政", "行動", "少花費兩個資源來建造一個新的農場或礦井", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5248, 1065, "建築工地", 1, "內政", "行動", "建設一個新的城市建築少支付兩個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5249, 1068, "戲劇", 1, "內政", "劇院", "", "燈泡:4;石頭:5", "音樂:2;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 4, 0, 0));
        ca.add(new AgesCard(5250, 1070, "掠奪", 1, "軍事", "侵略", "侵略成功時,受害方:失去三個食物資源,侵略方:獲得同等食物資源(總計三個)", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5251, 1073, "方陣", 1, "軍事", "戰術", "", "步:2;馬:1", "武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5252, 1077, "灌溉", 1, "內政", "農場", "", "燈泡:3;石頭:4", "食物:2", "null", "棕色", 2, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(5253, 1078, "煉金術", 1, "內政", "實驗室", "", "燈泡:4;石頭:6", "燈泡:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 4, 0, 0));
        ca.add(new AgesCard(5254, 1084, "神學", 1, "內政", "神廟", "", "燈泡:2;石頭:5", "音樂:1;笑臉:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 2, 0, 0));
        ca.add(new AgesCard(5255, 1090, "突襲", 1, "軍事", "侵略", "侵略成功時,受害方:失去一城市建築物，侵略方:獲得造價一半資源", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5256, 1095, "輕騎兵", 1, "軍事", "戰術", "", "馬:2", "武器:2", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5257, 1098, "重騎兵", 1, "軍事", "戰術", "", "馬:3", "武器:4", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5258, 1099, "鐵礦", 1, "內政", "礦山", "", "燈泡:5;石頭:5", "石頭:2", "null", "棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0));
        ca.add(new AgesCard(5259, 1102, "騎士", 1, "內政", "騎兵", "", "燈泡:4;石頭:3", "武器:2", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 4, 0, 0));
        ca.add(new AgesCard(5260, 1103, "高效升級", 1, "內政", "行動", "少花費2個資源，升級一塊農田、一個礦場或是一處城市建築物", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5261, 1124, "防禦卡", 2, "軍事", "獎勵", "防禦+4 殖民+2", "", "", "null", "雙色", 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5262, 1125, "富饒之土", 2, "內政", "行動", "少花費三個資源來建造一個新的農場或礦井", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5263, 1132, "建築工地", 2, "內政", "行動", "建設一個新的城市建築少支付三個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5264, 1137, "掠奪", 2, "軍事", "侵略", "侵略成功時,受害方:失去五個食物資源,侵略方:獲得同等食物資源(總計五個)", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5265, 1140, "新聞業", 2, "內政", "圖書館", "", "燈泡:6;石頭:8", "音樂:2;燈泡:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 6, 0, 0));
        ca.add(new AgesCard(5266, 1144, "歌劇", 2, "內政", "劇院", "", "燈泡:7;石頭:9", "音樂:3;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 7, 0, 0));
        ca.add(new AgesCard(5267, 1149, "火砲", 2, "內政", "炮兵", "", "燈泡:7;石頭:5", "武器:3", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 7, 0, 0));
        ca.add(new AgesCard(5268, 1151, "愛國主義", 2, "內政", "行動", "本輪獲得額外的一個軍事行動，額外三點資源建造軍隊", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5269, 1156, "礦藏", 2, "內政", "行動", "你的文明生產三個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5270, 1158, "科學方法", 2, "內政", "實驗室", "", "燈泡:6;石頭:8", "燈泡:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 6, 0, 0));
        ca.add(new AgesCard(5271, 1165, "突襲", 2, "軍事", "侵略", "侵略成功時,受害方:失去兩城市建築物，侵略方:獲得造價一半資源", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5272, 1166, "組織化宗教", 2, "內政", "神廟", "", "燈泡:4;石頭:7", "音樂:1;笑臉:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 4, 0, 0));
        ca.add(new AgesCard(5273, 1174, "西班牙陣型", 2, "軍事", "戰術", "", "步:1;馬:2", "武器:5;過期武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 3, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5274, 1178, "間諜", 2, "軍事", "侵略", "侵略成功時,受害方:失去最多五點科技,侵略方:獲得相同科技點數", "", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5275, 1180, "防禦陣型", 2, "軍事", "戰術", "", "步:2;炮:1", "武器:6;過期武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 3, 0, 0, 2, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5276, 1206, "多媒體", 3, "內政", "圖書館", "", "燈泡:9;石頭:11", "音樂:3;燈泡:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 9, 0, 0));
        ca.add(new AgesCard(5277, 1208, "防禦卡", 3, "軍事", "獎勵", "防禦+6 殖民+3", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5278, 1222, "文化戰爭", 3, "軍事", "戰爭", "戰勝方:獲得文明點數=軍力差，失敗方:失去文明點數=軍力差", "消耗紅點:3", "", "null", "黑色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(5279, 1225, "武裝入侵", 3, "軍事", "侵略", "侵略成功時,受害方:失去七點文明點數,侵略方:獲得七點文明點數", "消耗紅點:2", "", "null", "深棕色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5280, 1228, "火箭", 3, "內政", "炮兵", "", "燈泡:10;石頭:7", "武器:5", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 10, 0, 0));
        ca.add(new AgesCard(5281, 1233, "電影", 3, "內政", "劇院", "", "燈泡:10;石頭:12", "音樂:4;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 10, 0, 0));
        ca.add(new AgesCard(5282, 1239, "突襲", 3, "軍事", "侵略", "侵略成功時,受害方:失去三城市建築物，侵略方:獲得造價一半資源", "消耗紅點:3", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(5283, 1245, "計算機", 3, "內政", "實驗室", "", "燈泡:8;石頭:10", "燈泡:5", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 8, 0, 0));
        ca.add(new AgesCard(5299, 1001, "專制", 0, "內政", "政府", "", "", "+白點:4;+紅點:2;+房屋:2", "null", "橙色", 1, 0, 0, 0, 0, 4, 0, 2, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5300, 1002, "亞歷山大圖書館", 0, "內政", "奇蹟", "你可以額外保留一張內政牌一張軍事牌", "奇蹟石頭:1-2-2-1", "音樂:1;燈泡:1", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5301, 1003, "亞歷山大大帝", 0, "內政", "領袖", "每個軍事單位的力量加一", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5302, 1004, "亞里士多得", 0, "內政", "領袖", "每從排列獲得一張科技牌,就獲得一個科技點數", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5303, 1005, "人口的發展", 0, "軍事", "事件", "每個文明免費獲得一個人口", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5304, 1006, "軍事的發展", 0, "軍事", "事件", "每名玩家可以免費將一名閒置工人升級為軍事部隊", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5305, 1007, "農業", 0, "內政", "農場", "", "石頭:2", "食物:1", "null", "棕色", 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0));
        ca.add(new AgesCard(5306, 1008, "農業的發展", 0, "軍事", "事件", "每個文明生產兩個食物", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5307, 1009, "凱薩", 0, "內政", "領袖", "軍事力量+1 軍事行動 MA+1", "", "武器:1;+紅點:1", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5308, 1010, "哲學", 0, "內政", "實驗室", "", "石頭:3", "燈泡:1", "null", "灰色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0));
        ca.add(new AgesCard(5309, 1011, "宗教", 0, "內政", "神廟", "", "石頭:3", "音樂:1;笑臉:1", "null", "灰色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0));
        ca.add(new AgesCard(5310, 1012, "宗教的發展", 0, "軍事", "事件", "每個玩家可以使用一個限制的工人免費修建寺廟", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5311, 1013, "富饒之土", 0, "內政", "行動", "少花費一個資源建造一個農場或礦場", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5312, 1014, "工程天才", 0, "內政", "行動", "本輪完成奇蹟的一步建設時少花費兩個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5313, 1015, "巨人像", 0, "內政", "奇蹟", "殖民時獲得獎勵+1", "奇蹟石頭:3-3", "音樂:1;武器:1", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5314, 1016, "市場的發展", 0, "軍事", "事件", "每個文明生產兩個食物或兩個資源(玩家自行決定)", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5315, 1017, "建築工地", 0, "內政", "行動", "建築一座新的城市建築少花費一個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5316, 1018, "戰士", 0, "內政", "步兵", "", "石頭:2", "武器:1", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0));
        ca.add(new AgesCard(5317, 1019, "手工業的發展", 0, "軍事", "事件", "每個文明生產兩個資源", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5318, 1020, "摩西", 0, "內政", "領袖", "增加人口時少消耗一個食物", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5319, 1021, "政治的發展", 0, "軍事", "事件", "每個玩家可抽取三張軍事牌,當前玩家本輪不需要棄掉軍事牌", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5320, 1022, "無事件", 0, "軍事", "事件", "什麼都沒有發生", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5321, 1023, "漢摩拉比", 0, "內政", "領袖", "內政行動CA+1 軍事行動MA-1", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5322, 1024, "愛國主義", 0, "內政", "行動", "本輪獲得一個額外的軍事行動和一個額外的資源用於建造軍隊", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5323, 1025, "科技的發展", 0, "軍事", "事件", "每個文明獲得兩點科技點數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5324, 1026, "空中花園", 0, "內政", "奇蹟", "", "奇蹟石頭:2-2-2", "音樂:1;笑臉:2", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5325, 1027, "藝術作品", 0, "內政", "行動", "獲得六點文化分數", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5326, 1028, "節儉", 0, "內政", "行動", "以正常價格增加一個人口後,獲得一個食物", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5327, 1029, "荷馬", 0, "內政", "領袖", "每輪獲得一個額外資源用於建造軍隊,每個戰士每輪獲得一點文化(最多為兩點)", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5328, 1030, "貿易的發展", 0, "軍事", "事件", "每個文明獲得一個科技點數,生產一個食物和一個資源", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5329, 1031, "金字塔", 0, "內政", "奇蹟", "獲得一點內政行動", "奇蹟石頭:3-2-1", "+白點:1", "null", "紫色", 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5330, 1032, "青銅", 0, "內政", "礦山", "", "石頭:2", "石頭:1", "null", "棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0));
        ca.add(new AgesCard(5331, 1033, "革新思想", 0, "內政", "行動", "獲得一點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5332, 1036, "萬里長城", 1, "內政", "奇蹟", "每個步兵和砲兵有額外一點軍力加成", "奇蹟石頭:2-2-3-2", "音樂:1;笑臉:1", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5333, 1037, "中世紀軍隊", 1, "軍事", "戰術", "", "步:1;馬:1", "武器:2", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5334, 1038, "豐收", 1, "內政", "行動", "獲得兩個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5335, 1039, "兵家必爭之地", 1, "軍事", "領土", "", "軍事牌:3", "武器:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5336, 1040, "兵陣", 1, "軍事", "戰術", "", "步:2", "", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5337, 1041, "戰爭機構", 1, "內政", "軍事", "軍力+1 軍事行動+1", "燈泡:4", "武器:1;+紅點:1", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0));
        ca.add(new AgesCard(5338, 1042, "軍團", 1, "軍事", "戰術", "", "步:3", "武器:2", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5339, 1043, "製圖術", 1, "內政", "殖民", "軍力+1 殖民時額外獲得兩點軍力(同種特殊科技只能擁有一張)", "燈泡:4", "武器:1;", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0));
        ca.add(new AgesCard(5340, 1044, "劍士", 1, "內政", "步兵", "", "燈泡:3;石頭:3", "武器:2", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 0, 0));
        ca.add(new AgesCard(5341, 1045, "劫掠", 1, "軍事", "事件", "軍力最弱的兩個文明，各失去兩個食物或資源", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5342, 1046, "十字軍東征", 1, "軍事", "事件", "軍力最強的文明獲得四點文明分數,軍力最弱的文民失去四點文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5343, 1047, "卡羅琳娜大學", 1, "內政", "奇蹟", "", "奇蹟石頭:3-3-3", "音樂:1;燈泡:2", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5344, 1048, "印刷術", 1, "內政", "圖書館", "", "燈泡:3;石頭:4", "音樂:1;燈泡:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(5345, 1049, "歷史悠久之地", 1, "軍事", "領土", "", "音樂:6", "笑臉:1", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6));
        ca.add(new AgesCard(5346, 1051, "叛亂", 1, "軍事", "事件", "每擁有一個不幸福的工人,下回合將減少兩個內政行動", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5347, 1052, "君主制", 1, "內政", "政府", "", "和平燈炮:9;革命燈泡:3", "+白點:5;+紅點:3;+房屋:3", "null", "橙色", 1, 0, 0, 0, 0, 5, 0, 3, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 3, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5348, 1053, "河蟹娛樂", 1, "內政", "競技場", "", "燈泡:3;石頭:4", "武器:1;笑臉:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(5349, 1055, "哥倫布", 1, "內政", "領袖", "你可以在政治行動中直接打出並殖民一塊殖民地不需要犧牲任何軍隊(此能力只能使用一次)", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5350, 1056, "聖女貞德", 1, "內政", "領袖", "神殿每個笑臉給予軍力+1", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5351, 1057, "聖彼得大教堂", 1, "內政", "奇蹟", "所有幸福指數加倍", "奇蹟石頭:4-4", "音樂:2", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5352, 1058, "防禦卡", 1, "軍事", "獎勵", "防禦+2 殖民+1", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5353, 1059, "奴役", 1, "軍事", "侵略", "侵略成功時,受害方:失去一個人口,侵略方:獲得三個資源", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5354, 1060, "好收成", 1, "軍事", "事件", "每個文明的農田立即生產一輪忽略消耗和腐敗", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5355, 1061, "富饒之土", 1, "內政", "行動", "少花費兩個資源來建造一個新的農場或礦井", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5356, 1062, "富饒肥沃之地", 1, "軍事", "領土", "", "食物:3", "+黃點:3", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0));
        ca.add(new AgesCard(5357, 1063, "工程天才", 1, "內政", "行動", "少花費三個資源來完成奇蹟的一步建設", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5358, 1064, "巴巴羅薩", 1, "內政", "領袖", "你可以使用一個內政行動擴充一個人口並建造軍隊少花費一糧食和一礦", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5359, 1065, "建築工地", 1, "內政", "行動", "建設一個新的城市建築少支付兩個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5360, 1067, "恐怖地區", 1, "軍事", "事件", "軍事最弱的文民失去一個人口", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5361, 1068, "戲劇", 1, "內政", "劇院", "", "燈泡:4;石頭:5", "音樂:2;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 4, 0, 0));
        ca.add(new AgesCard(5362, 1069, "成吉思汗", 1, "內政", "領袖", "忽略己方戰術牌,騎兵+1軍力+1文明", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5363, 1070, "掠奪", 1, "軍事", "侵略", "侵略成功時,受害方:失去三個食物資源,侵略方:獲得同等食物資源(總計三個)", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5364, 1071, "文化的影響", 1, "軍事", "事件", "文明獲得其每輪增加的文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5365, 1072, "新的礦藏", 1, "軍事", "事件", "所有玩家的礦井立即生產一輪無視消耗和腐敗", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5366, 1073, "方陣", 1, "軍事", "戰術", "", "步:2;馬:1", "武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5367, 1074, "有人居住之地", 1, "軍事", "領土", "", "擴充人口:1", "+黃點:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5368, 1075, "法典", 1, "內政", "內政", "獲得一點內政行動", "", "+白點:1", "null", "藍色", 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5369, 1076, "泰姬陵", 1, "內政", "奇蹟", "", "奇蹟石頭:2-4-2", "音樂:3", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5370, 1077, "灌溉", 1, "內政", "農場", "", "燈泡:3;石頭:4", "食物:2", "null", "棕色", 2, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(5371, 1078, "煉金術", 1, "內政", "實驗室", "", "燈泡:4;石頭:6", "燈泡:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 4, 0, 0));
        ca.add(new AgesCard(5372, 1079, "愛國主義", 1, "內政", "行動", "本輪獲得額外一個軍事行動,額外兩個資源建造軍隊", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5373, 1080, "物資豐富之地", 1, "軍事", "領土", "", "石頭:5", "+藍點:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0));
        ca.add(new AgesCard(5374, 1081, "瘟疫", 1, "軍事", "事件", "所有的文名失去一個人口", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5375, 1082, "石工學", 1, "內政", "建築", "你的等級 I II III 的城市建築少花費1/1/1個資源,你可以用一個內政行動興建奇蹟的兩步(同種特殊科技只能擁有一張)", "", "", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5376, 1083, "礦藏", 1, "內政", "行動", "你的文明生產兩個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5377, 1084, "神學", 1, "內政", "神廟", "", "燈泡:2;石頭:5", "音樂:1;笑臉:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 2, 0, 0));
        ca.add(new AgesCard(5378, 1085, "神權政治", 1, "內政", "政府", "", "和平燈炮:7;革命燈泡:2", "+白點:4;+紅點:3;+房屋:3;笑臉:2", "null", "橙色", 1, 0, 0, 0, 0, 4, 0, 3, 0, 0, 0, 2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 2, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5379, 1086, "科技先進之地", 1, "軍事", "領土", "", "燈泡:3", "+黃點:1;+藍點:1", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0));
        ca.add(new AgesCard(5380, 1087, "科技突破", 1, "軍事", "事件", "所有文明按照其科技指數得到科技點數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5381, 1088, "移民", 1, "軍事", "事件", "擁有最高幸福指數的文明，增加一個人口", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5382, 1089, "突破", 1, "內政", "行動", "全價研發一項科技，然後獲得兩點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5383, 1090, "突襲", 1, "軍事", "侵略", "侵略成功時,受害方:失去一城市建築物，侵略方:獲得造價一半資源", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5384, 1091, "米開朗基羅", 1, "內政", "領袖", "神殿，劇院和奇蹟的每個笑臉每輪提供，額外一點文化分數，少花費一個內政行動拿奇蹟", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5385, 1092, "藝術作品", 1, "內政", "行動", "獲得五點文化分數", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5386, 1093, "節儉", 1, "內政", "行動", "以正常價格增加一個人口後,獲得兩個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5387, 1094, "蠻族入侵", 1, "軍事", "事件", "如果文化分數的領先者，恰好是軍力的倒數前兩名，你損失一個人口", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5388, 1095, "輕騎兵", 1, "軍事", "戰術", "", "馬:2", "武器:2", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5389, 1096, "邊境衝突", 1, "軍事", "事件", "軍力最弱的文明失去，一個城市建築物或是農場或是礦場，軍力最強的文明獲得三個資源", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5390, 1097, "達文西", 1, "內政", "領袖", "你最好的實驗室或圖書館，按照其等級生產額外科技，你每打一張科技牌時，獲得一個資源", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5391, 1098, "重騎兵", 1, "軍事", "戰術", "", "馬:3", "武器:4", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5392, 1099, "鐵礦", 1, "內政", "礦山", "", "燈泡:5;石頭:5", "石頭:2", "null", "棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0));
        ca.add(new AgesCard(5393, 1100, "革新思想", 1, "內政", "行動", "獲得二點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5394, 1101, "領土糾紛", 1, "軍事", "事件", "軍力最弱的文明，給予一個儲存人力到軍力最強的文明", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5395, 1102, "騎士", 1, "內政", "騎兵", "", "燈泡:4;石頭:3", "武器:2", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 4, 0, 0));
        ca.add(new AgesCard(5396, 1103, "高效升級", 1, "內政", "行動", "少花費2個資源，升級一塊農田、一個礦場或是一處城市建築物", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5397, 1104, "鼠疫", 1, "軍事", "事件", "所有的文明失去所有儲存的食物", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5398, 1107, "豐收", 2, "內政", "行動", "獲得三個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5399, 1108, "破碎的偶像", 2, "軍事", "事件", "移除除了當前時代以外的所有領袖牌", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5400, 1109, "克里姆林宮", 2, "內政", "奇蹟", "", "奇蹟石頭:4-4-4", "音樂:3;笑臉:-2;+白點:1;+紅點:1", "null", "紫色", 1, 0, 0, 0, 0, 1, 0, 1, 3, 0, 0, -2, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5401, 1110, "共和制", 2, "內政", "政府", "", "和平燈炮:14;革命燈泡:4", "+白點:7;+紅點:2;+房屋:3", "null", "橙色", 1, 0, 0, 0, 0, 7, 0, 2, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 4, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5402, 1111, "兵家必爭之地", 2, "軍事", "領土", "", "軍事牌:5", "武器:4", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5403, 1113, "冷戰", 2, "軍事", "事件", "軍力最強的兩個文明，獲得六點科技", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5404, 1114, "刺殺", 2, "軍事", "侵略", "消耗軍事行動=領袖等級，侵略成功時,受害方:領袖移除,侵略方:獲得領袖等級*3文明分數", "", "", "null", "深棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5405, 1115, "歷史悠久之地", 2, "軍事", "領土", "", "音樂:11", "笑臉:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11));
        ca.add(new AgesCard(5406, 1116, "古典陣型", 2, "軍事", "戰術", "", "步:2;馬:2", "武器:9;過期武器:4", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 4, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5407, 1117, "司法系統", 2, "內政", "內政", "獲得一點內政行動，和三個藍色資源方塊", "", "+白點:1;+藍點:3", "null", "藍色", 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5408, 1118, "君主立憲制", 2, "內政", "政府", "", "和平燈炮:12;革命燈泡:5", "+白點:6;+紅點:4;+房屋:3", "null", "橙色", 1, 0, 0, 0, 0, 6, 0, 4, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 5, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5409, 1119, "吞併", 2, "軍事", "侵略", "侵略成功時,受害方:失去一塊殖民地，和永久加成,侵略方:獲得一塊殖民地，和永久加成", "消耗紅點:2", "", "null", "深棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5410, 1120, "團隊競技", 2, "內政", "競技場", "", "燈泡:5;石頭:6", "武器:2;笑臉:3", "null", "灰色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 5, 0, 0));
        ca.add(new AgesCard(5411, 1121, "國際條約", 2, "軍事", "事件", "軍力最強的文明，可以立即從卡牌列拿總值為5的內政卡，同時放棄自己的下一個政治行動", "", "", "null", "null", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5412, 1123, "艾菲爾鐵塔", 2, "內政", "奇蹟", "", "奇蹟石頭:3-7-3", "音樂:4;笑臉:1", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5413, 1124, "防禦卡", 2, "軍事", "獎勵", "防禦+4 殖民+2", "", "", "null", "雙色", 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5414, 1125, "富饒之土", 2, "內政", "行動", "少花費三個資源來建造一個新的農場或礦井", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5415, 1126, "富饒肥沃之地", 2, "軍事", "領土", "", "食物:5", "+黃點:4", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0));
        ca.add(new AgesCard(5416, 1127, "工程天才", 2, "內政", "行動", "少花費四個資源來完成奇蹟的一步建設", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5417, 1128, "巴哈", 2, "內政", "領袖", "打出劇場科技少花費一科技，劇場建設少花費一資源，每個劇場多生產一點文明", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5418, 1129, "市民暴動", 2, "軍事", "事件", "所有的文明每有一個不高興的工人，就失去四點文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5419, 1130, "庫克船長", 2, "內政", "領袖", "殖民地每塊獲得兩文明分數，再殖民時所打出的殖民獎勵牌的效果+1", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5420, 1131, "建築學", 2, "內政", "建築", "你的等級 I II III 的城市建築少花費1/2/2個資源,你可以用一個內政行動興建奇蹟的三步(同種特殊科技只能擁有一張)", "", "", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5421, 1132, "建築工地", 2, "內政", "行動", "建設一個新的城市建築少支付三個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5422, 1133, "恐怖主義", 2, "軍事", "事件", "當前分數最低的玩家，立即拆毀，其他玩家每人一座城市建築物", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5423, 1134, "戰略", 2, "內政", "軍事", "軍力+3 軍事行動+2", "燈泡:8", "武器:3;+紅點:2", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0));
        ca.add(new AgesCard(5424, 1135, "拿破崙", 2, "內政", "領袖", "獲得一個軍事行動，最強大的集團軍戰術獎勵加倍", "", "+紅點:1", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5425, 1136, "拿破崙陣型", 2, "軍事", "戰術", "", "步:1;馬:1;炮:1", "武器:8;過期武器:4", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 4, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5426, 1137, "掠奪", 2, "軍事", "侵略", "侵略成功時,受害方:失去五個食物資源,侵略方:獲得同等食物資源(總計五個)", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5427, 1139, "文化戰爭", 2, "軍事", "戰爭", "戰勝方:獲得文明點數=軍力差，失敗方:失去文明點數=軍力差", "消耗紅點:3", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(5428, 1140, "新聞業", 2, "內政", "圖書館", "", "燈泡:6;石頭:8", "音樂:2;燈泡:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 2, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 6, 0, 0));
        ca.add(new AgesCard(5429, 1141, "時間的洪流", 2, "軍事", "事件", "每個玩家選擇一個時代為A獲I的奇蹟將其翻轉，效果消失失去奇蹟的玩家獲得兩點文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5430, 1142, "有人居住之地", 2, "軍事", "領土", "", "擴充人口:2", "+黃點:3", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5431, 1143, "機動部隊", 2, "軍事", "戰術", "", "馬:1;炮:1", "武器:5", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5432, 1144, "歌劇", 2, "內政", "劇院", "", "燈泡:7;石頭:9", "音樂:3;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 7, 0, 0));
        ca.add(new AgesCard(5433, 1145, "民族主義浪潮", 2, "內政", "行動", "每有一個軍力比你強大的文明對手時，你獲得額外的2/3/6個資源用於訓練部隊是用于4/3/2人遊戲中", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5434, 1146, "民族的自豪", 2, "軍事", "事件", "當前文明分數領先者，獲得五點文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5435, 1147, "洲際鐵路", 2, "內政", "奇蹟", "軍力加五最高等級的一塊礦井，每回合生產雙倍資源", "奇蹟石頭:3-4-5", "武器:5", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5436, 1148, "火槍兵", 2, "內政", "步兵", "", "燈泡:5;石頭:5", "武器:3", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0));
        ca.add(new AgesCard(5437, 1149, "火砲", 2, "內政", "炮兵", "", "燈泡:7;石頭:5", "武器:3", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 7, 0, 0));
        ca.add(new AgesCard(5438, 1150, "煤礦", 2, "內政", "礦山", "", "燈泡:7;石頭:8", "石頭:3", "null", "棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 7, 0, 0));
        ca.add(new AgesCard(5439, 1151, "愛國主義", 2, "內政", "行動", "本輪獲得額外的一個軍事行動，額外三點資源建造軍隊", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5440, 1152, "牛頓", 2, "內政", "領袖", "你最好的實驗室或圖書館，按照其等級生產額外科技，你每打一張科技牌時，回收一點內政點數", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5441, 1153, "物資豐富之地", 2, "軍事", "領土", "", "石頭:8", "+藍點:3", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0));
        ca.add(new AgesCard(5442, 1154, "獨立宣言", 2, "軍事", "事件", "軍力最弱的文明失去一個殖民地(玩家自主選擇)", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5443, 1155, "胸甲騎兵", 2, "內政", "騎兵", "", "燈泡:6;石頭:5", "武器:3", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 6, 0, 0));
        ca.add(new AgesCard(5444, 1156, "礦藏", 2, "內政", "行動", "你的文明生產三個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5445, 1157, "破壞", 2, "軍事", "侵略", "侵略成功時,受害方:器掉一個建設中的奇蹟，侵略方:獲得每奇蹟等級*3分數消耗的軍事行動等於奇蹟等級", "", "", "null", "深棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5446, 1158, "科學方法", 2, "內政", "實驗室", "", "燈泡:6;石頭:8", "燈泡:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 6, 0, 0));
        ca.add(new AgesCard(5447, 1160, "科技戰爭", 2, "軍事", "戰爭", "戰敗方:失去科技點數=軍力差，戰勝方:獲得相同數量科技點數=軍力差", "消耗紅點:2", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5448, 1161, "科技領先之地", 2, "軍事", "領土", "", "燈泡:5", "+黃點:2;+藍點:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0));
        ca.add(new AgesCard(5449, 1162, "科普教育", 2, "軍事", "事件", "文明獲得與其每輪增加的科技點數的文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5450, 1163, "移民出境", 2, "軍事", "事件", "所有文名失去一半自己不快樂的工人(將他們放置回人力堆)", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5451, 1164, "突破", 2, "內政", "行動", "全價研發一項科技，然後獲得四點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5452, 1165, "突襲", 2, "軍事", "侵略", "侵略成功時,受害方:失去兩城市建築物，侵略方:獲得造價一半資源", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5453, 1166, "組織化宗教", 2, "內政", "神廟", "", "燈泡:4;石頭:7", "音樂:1;笑臉:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 4, 0, 0));
        ca.add(new AgesCard(5454, 1167, "經濟發展", 2, "軍事", "事件", "所有農業和礦山立即生產一輪，紀錄食物的消耗和資源的腐敗", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5455, 1168, "羅伯斯比爾", 2, "內政", "領袖", "獲得一個軍是行動，革命消耗你所有的軍是行動而不是內政行動", "", "+紅點:1", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5456, 1169, "罪惡之都", 2, "軍事", "事件", "軍力最弱的兩個文明，失去三點文明分數和一個藍色資源標記", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5457, 1170, "航海術", 2, "內政", "殖民", "軍力+2 殖民時額外獲得三點軍力(同種特殊科技只能擁有一張)", "燈泡:6", "武器:2;", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 0, 0));
        ca.add(new AgesCard(5458, 1171, "藝術作品", 2, "內政", "行動", "獲得四點文化分數", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5459, 1172, "節儉", 2, "內政", "行動", "以正常價格增加一個人口後,獲得三個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5460, 1173, "莎士比亞", 2, "內政", "領袖", "圖書館額外產生一點文明，圖書館+劇院的組合，額外產生兩點文明分數", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5461, 1174, "西班牙陣型", 2, "軍事", "戰術", "", "步:1;馬:2", "武器:5;過期武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 3, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5462, 1175, "資源戰爭", 2, "軍事", "戰爭", "戰敗方:失去食物和或資源=軍力差，戰勝方:獲得相同數量資源=軍力差", "消耗紅點:2", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5463, 1176, "遠洋客運", 2, "內政", "奇蹟", "每個回合一次，你可以不使用內政行動力來增加一個人口，並且少支付5個食物", "奇蹟石頭:3-2-2-2-3", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5464, 1177, "選種培育", 2, "內政", "農場", "", "燈泡:5;石頭:6", "食物:3", "null", "棕色", 1, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 5, 0, 0));
        ca.add(new AgesCard(5465, 1178, "間諜", 2, "軍事", "侵略", "侵略成功時,受害方:失去最多五點科技,侵略方:獲得相同科技點數", "", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5466, 1179, "防禦工事", 2, "軍事", "戰術", "", "炮:2", "武器:4;", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5467, 1180, "防禦陣型", 2, "軍事", "戰術", "", "步:2;炮:1", "武器:6;過期武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 3, 0, 0, 2, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5468, 1181, "難民", 2, "軍事", "事件", "軍力最弱的文明，失去三點文明分數和一個人口，軍力最強的文明，或德三點文明分數和一個人口", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5469, 1182, "革新思想", 2, "內政", "行動", "獲得四點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5470, 1183, "領土戰爭", 2, "軍事", "戰爭", "戰敗方:失去1+軍力差/3個數的人口標紀，戰勝方:獲得相同數量的人口標紀", "消耗紅點:3", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(5471, 1184, "高效升級", 2, "內政", "行動", "少花費3個資源，升級一塊農田、一個礦場或是一處城市建築物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5472, 1185, "F14", 3, "內政", "領袖", "所有實驗室每等級產生一點文明分數，所有實驗室少生產一點科技", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5473, 1186, "邱吉爾", 3, "內政", "領袖", "部隊的科技牌少3點科技，防禦牌效果加倍，當有人對你宣戰時，軍對的建設費用減少兩點", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5474, 1188, "豐收", 3, "內政", "行動", "獲得四個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5475, 1189, "人口的影響", 3, "軍事", "事件", "所有文明立即得分，分數為(已使用人口-10)*2", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5476, 1190, "公共服務", 3, "內政", "內政", "或得兩個內政行動，以及三個藍色標志", "", "+白點:2;+藍點:3", "null", "藍色", 1, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5477, 1191, "共產主義", 3, "內政", "政府", "", "和平燈炮:17;革命燈泡:6", "+白點:7;+紅點:5;+房屋:4;笑臉:-1", "null", "橙色", 1, 0, 0, 0, 0, 7, 0, 5, 0, 0, 0, -1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 6, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5478, 1193, "軍事建設", 3, "內政", "行動", "", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5479, 1194, "軍事倫理", 3, "內政", "軍事", "軍力+5 軍事行動+3", "燈泡:12", "武器:5;+紅點:3", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 0, 0));
        ca.add(new AgesCard(5480, 1195, "軍力的影響", 3, "軍事", "事件", "所有文明立即，依據軍力排名得分，2人:10/0，3人:14/7/0，4人:15/10/5/0", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5481, 1196, "農業的影響", 3, "軍事", "事件", "所有文明立即得分，分數為各個文明的糧食產量", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5482, 1197, "衛星", 3, "內政", "殖民", "軍力+3 殖民時額外獲得四點軍力(同種特殊科技只能擁有一張)", "燈泡:8", "武器:3;", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0));
        ca.add(new AgesCard(5483, 1198, "歷史進程的影響", 3, "軍事", "事件", "所有文明立即得分，分數為政府和特殊科技的總等級數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5484, 1199, "原教旨主義", 3, "內政", "政府", "", "和平燈炮:19;革命燈泡:7", "+白點:6;+紅點:5;+房屋:4;武器:5", "null", "橙色", 1, 0, 0, 0, 0, 6, 0, 5, 0, 0, 0, 0, 4, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 19, 7, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5485, 1201, "因特網", 3, "內政", "奇蹟", "立即從每個圖書館和實驗室或得分數，數值為建築等級的兩倍", "奇蹟石頭:2-3-4-3-2", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5486, 1203, "聖戰", 3, "軍事", "戰爭", "戰敗方:減人口=軍力差/3，戰勝方:得分=人口數*3 ", "消耗紅點:3", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(5487, 1204, "甘地", 3, "內政", "領袖", "你無法打出侵略或戰爭牌，期他玩家對你的侵略或戰爭需要花費兩倍的軍是點數", "", "音樂:2", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5488, 1205, "坦克", 3, "內政", "騎兵", "", "燈泡:9;石頭:7", "武器:5", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 9, 0, 0));
        ca.add(new AgesCard(5489, 1206, "多媒體", 3, "內政", "圖書館", "", "燈泡:9;石頭:11", "音樂:3;燈泡:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 9, 0, 0));
        ca.add(new AgesCard(5490, 1207, "奇蹟的影響", 3, "軍事", "事件", "所有文明立即按照建成奇蹟，數量來得分奇蹟A/I/II/III分別獲得5/4/3/2點文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5491, 1208, "防禦卡", 3, "軍事", "獎勵", "防禦+6 殖民+3", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5492, 1209, "好萊烏", 3, "內政", "奇蹟", "立即從每個圖書館和劇場得分，分數為各建築等級的兩倍", "奇蹟石頭:5-6-5", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5493, 1210, "尼古拉特斯拉", 3, "內政", "領袖", "所有實驗室按等級生產資源，其他玩家在建造或升級，他們的實驗室或圖書館需要花費額外一個資源", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5494, 1211, "工業的影響", 3, "軍事", "事件", "所有文明立即得分，分數為所有的礦場的資源產量", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5495, 1212, "工程天才", 3, "內政", "行動", "少花費五個資源來完成奇蹟的一步建設", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5496, 1213, "工程學", 3, "內政", "建築", "你的等級 I II III 的城市建築少花費1/2/3個資源,你可以用一個內政行動興建奇蹟的四步(同種特殊科技只能擁有一張)", "", "", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5497, 1214, "幸福的影響", 3, "軍事", "事件", "所有文明立即得分，分數為幸福度*2(最多16)每個失業的工人扣兩分", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5498, 1215, "建築工地", 3, "內政", "行動", "建設一個新的城市建築少支付四個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5499, 1216, "建築的影響", 3, "軍事", "事件", "所有文明立即或得分數，分數為城市建築等級總和", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5500, 1217, "快餐連鎖", 3, "內政", "奇蹟", "立即從每個隊伍和城市建築或得一分，立即從每個農場和礦場獲得兩分", "奇蹟石頭:4-4-4-4", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5501, 1218, "戰壕", 3, "軍事", "戰術", "", "步:1;炮:2", "武器:9:過期武器:5", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 1, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5502, 1219, "技術的影響", 3, "軍事", "事件", "所有文明立即得分，分數為等級III科技牌數量*4", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5503, 1220, "掠奪", 3, "軍事", "侵略", "侵略成功時,受害方:失去八個食物資源,侵略方:獲得同等食物資源(總計八個)", "消耗紅點:3", "", "null", "深棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(5504, 1221, "政府的影響", 3, "軍事", "事件", "所有文明立即得分，分數為內政行動*2+軍事行動", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5505, 1222, "文化戰爭", 3, "軍事", "戰爭", "戰勝方:獲得文明點數=軍力差，失敗方:失去文明點數=軍力差", "消耗紅點:3", "", "null", "黑色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(5506, 1223, "機械化農業", 3, "內政", "農場", "", "燈泡:7;石頭:8", "食物:5", "null", "棕色", 1, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 7, 0, 0));
        ca.add(new AgesCard(5507, 1224, "機械化部隊", 3, "軍事", "戰術", "", "馬:1;炮:2", "武器:10;過期武器:5", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5, 0, 0, 0, 0, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5508, 1225, "武裝入侵", 3, "軍事", "侵略", "侵略成功時,受害方:失去七點文明點數,侵略方:獲得七點文明點數", "消耗紅點:2", "", "null", "深棕色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(5509, 1226, "殖民地的影響", 3, "軍事", "事件", "所有文明立即得分，分數為殖民地數量*4", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5510, 1227, "民主制", 3, "內政", "政府", "", "和平燈炮:21;革命燈泡:8", "+白點:7;+紅點:3;+房屋:4;音樂:2", "null", "橙色", 1, 0, 0, 0, 0, 7, 0, 3, 2, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 8, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5511, 1228, "火箭", 3, "內政", "炮兵", "", "燈泡:10;石頭:7", "武器:5", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 10, 0, 0));
        ca.add(new AgesCard(5512, 1229, "愛因斯坦", 3, "內政", "領袖", "你最好的實驗室或圖書館，按照其等級生產額外科技，你每打一張科技牌時，獲得三點文明分數", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5513, 1230, "愛國主義", 3, "內政", "行動", "", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5514, 1231, "現代化步兵", 3, "內政", "步兵", "", "燈泡:7;石頭:7", "武器:5", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 7, 0, 0));
        ca.add(new AgesCard(5515, 1232, "現代化軍隊", 3, "軍事", "戰術", "", "步:2;馬:1;炮:1", "武器:13;過期武器:7", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 7, 0, 0, 2, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5516, 1233, "電影", 3, "內政", "劇院", "", "燈泡:10;石頭:12", "音樂:4;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 10, 0, 0));
        ca.add(new AgesCard(5517, 1234, "石油", 3, "內政", "礦山", "", "燈泡:9;石頭:11", "石頭:5", "null", "棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 9, 0, 0));
        ca.add(new AgesCard(5518, 1235, "礦床", 3, "內政", "行動", "你的文明生產四個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5519, 1236, "科學的影響", 3, "軍事", "事件", "所有文明立即依據科技排名得分，2人:10/0，3人:14/7/0，4人:15/10/5/0", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5520, 1237, "空軍", 3, "內政", "空軍", "", "", "武器:5", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5521, 1238, "空間飛行", 3, "內政", "奇蹟", "立即從每張科技排獲得分數，分值為科技牌的等級", "奇蹟石頭:3-4-9", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5522, 1239, "突襲", 3, "軍事", "侵略", "侵略成功時,受害方:失去三城市建築物，侵略方:獲得造價一半資源", "消耗紅點:3", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(5523, 1240, "競爭力的影響", 3, "軍事", "事件", "所有文明立即得分，分數為所有軍隊單位和競技場的總等級數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5524, 1241, "約翰藍儂", 3, "內政", "領袖", "獲得兩個額外的笑臉，你最好的劇院產生，兩倍的文明分數", "", "笑臉:2", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5525, 1242, "職業競技", 3, "內政", "競技場", "", "燈泡:7;石頭:8", "武器:3;笑臉:4", "null", "灰色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 7, 0, 0));
        ca.add(new AgesCard(5526, 1243, "藝術作品", 3, "內政", "行動", "獲得三點文化分數", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5527, 1244, "藝術捐獻", 3, "內政", "行動", "每一個文明點數高於你的文明，你獲得6/4/3點文明分數，適於用2/3/4人遊戲", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5528, 1245, "計算機", 3, "內政", "實驗室", "", "燈泡:8;石頭:10", "燈泡:5", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 8, 0, 0));
        ca.add(new AgesCard(5529, 1246, "閃電戰", 3, "軍事", "戰術", "", "步:1;馬:3", "武器:11;過期武器:6", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 6, 0, 0, 1, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5530, 1247, "革命性理念", 3, "內政", "行動", "獲得六點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5531, 1248, "高效升級", 3, "內政", "行動", "少花費4個資源，升級一塊農田、一個礦場或是一處城市建築物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(5532, 1257, "突襲", 1, "軍事", "事件", "軍力最強的兩個文明，每人獲得3點食物/資源", "", "", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));

        return ca;
    }


}
